"""

1. Возможность выбора между Входом и Регистрацией
    1.1. Проверка прав доступа (если админ - запускается админ-панель, в другом случае см. п.2)
2. После входа или регистрации цикл, выводящий список возможных действий:
    2.1. Каталог товаров
        2.1.1. Добавление товара в корзину и указание количества 
        2.1.2. Отмена
    2.2. Корзина
        2.2.1. Список товаров
        2.2.2. Функция очистки корзины или конкретного товара
        2.2.3. Оплатить корзину
    2.3. Выйти из профиля

    
"""