"""

-- Функции --

1. Регистрация -- Пользователь может зарегистрироваться, введя логин и пароль. Данные сохраняются в json-файл.

2. Авторизация(войти как обычный пользователь) -- Пользователь может войти в систему, используя логин и пароль. При успешной авторизации открывается доступ
                                                  к остальным функциям
                                                  
3. Авторизация(войти как администратор) -- функция доступна только после прохождения обычной авторизации. Если условие соблюдено, потребуется ввести пароль.


"""
