"""

Реализовать функции:

1. Администратор может добавлять новые товары в каталог. Требуется отдельная роль "администратор".

2. Администратор может удалять товары из каталога по ID.

3. Отображение общей выручки магазина.

4. Init py
    4.1. После входа или регистрации цикл, выводящий список возможных действий:
        4.1.1. Каталог товаров
            4.1.1.1. Добавление товара в каталог 
            4.1.1.2. Удаление товара из каталога
        4.2.2. Отобразить выручку магазина

5. Выход из профиля



"""